{
  "id": "introduzione",
  "title": "Introduzione a Python",
  "explanation": "<h2>Benvenuto nel Mondo di Python!</h2>\n<p>Ciao! Stai per iniziare un viaggio nell'universo di Python, uno dei linguaggi di programmazione più popolari e versatili al mondo. Perché Python?</p>\n<ul>\n    <li><strong>Sintassi Chiara:</strong> Il codice Python assomiglia molto all'inglese, rendendolo più facile da leggere e scrivere rispetto a molti altri linguaggi. Questo lo rende ideale per i principianti.</li>\n    <li><strong>Versatilità:</strong> Python viene usato ovunque! Dallo sviluppo web (con framework come Django e Flask) all'analisi dei dati, intelligenza artificiale, machine learning, automazione di compiti, scripting, sviluppo di giochi e molto altro.</li>\n    <li><strong>Grande Comunità:</strong> Esiste una vasta e attiva comunità di sviluppatori Python. Questo significa tantissime librerie (codice pre-scritto che puoi riutilizzare), tutorial, forum di aiuto e documentazione.</li>\n    <li><strong>Interattivo:</strong> Puoi scrivere ed eseguire codice Python una riga alla volta, il che è ottimo per sperimentare e imparare.</li>\n</ul>\n<p>In questo corso interattivo, non solo leggerai le spiegazioni, ma potrai scrivere ed eseguire codice Python direttamente nel browser. Partiremo dalle basi assolute, come le variabili e i tipi di dati, per poi passare a concetti più avanzati.</p>\n<p>L'obiettivo è darti una solida comprensione dei fondamenti di Python, permettendoti di scrivere i tuoi primi programmi e di avere le basi per esplorare aree più specifiche in futuro.</p>\n<p>Non preoccuparti se all'inizio qualcosa sembra complesso. La programmazione è un'abilità che si costruisce con la pratica e la perseveranza. Sbagliare fa parte del processo di apprendimento!</p>\n<p>Sei pronto? Iniziamo dal concetto fondamentale delle variabili nel prossimo capitolo!</p>",
  "exercise": "<p>Questo capitolo è solo introduttivo.</p>\n<p>Per prendere confidenza con l'editor, prova a modificare il messaggio nel codice predefinito qui sotto e premi \"Esegui Codice\". Ad esempio, cambia \"Ciao, Python!\" in \"Ciao, Mondo!\".</p>"
}
